foam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            turbulentInlet;
        referenceField  uniform (50 0 0);
        fluctuationScale (5 5 5);
        fluctuationT    0.1;
        value           uniform (50 0 0);
    }

    outlet      { type zeroGradient; }

    seabed      { type noSlip; }

    top         { type fixedValue; value uniform (0 0 0); }

    side1       { type noSlip; }
    side2       { type noSlip; }

    submarine   { type noSlip; }
}
