foam/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inlet      { type fixedValue; value uniform 0.001; }
    outlet     { type zeroGradient; }

    seabed     { type kqRWallFunction; value uniform 0.0001; }
    top        { type zeroGradient; }

    side1      { type kqRWallFunction; value uniform 0.0001; }
    side2      { type kqRWallFunction; value uniform 0.0001; }

    submarine  { type kqRWallFunction; value uniform 0.0001; }
}
