foam/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet      { type fixedValue; value uniform 0; }
    outlet     { type zeroGradient; }

    seabed     { type nutUSpaldingWallFunction; value uniform 0; }
    top        { type zeroGradient; }

    side1      { type nutUSpaldingWallFunction; value uniform 0; }
    side2      { type nutUSpaldingWallFunction; value uniform 0; }

    submarine  { type nutUSpaldingWallFunction; value uniform 0; }

    defaultFaces { type calculated; }
}
