foam/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    inlet      { type fixedValue; value uniform 10; }
    outlet     { type zeroGradient; }

    seabed     { type omegaWallFunction; value uniform 10; }
    top        { type zeroGradient; }

    side1      { type omegaWallFunction; value uniform 10; }
    side2      { type omegaWallFunction; value uniform 10; }

    submarine  { type omegaWallFunction; value uniform 10; }
}
