foam/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet      { type zeroGradient; }
    outlet     { type fixedValue; value uniform 0; }

    seabed     { type zeroGradient; }
    top        { type zeroGradient; }
    side1      { type zeroGradient; }
    side2      { type zeroGradient; }

    submarine  { type zeroGradient; }
}
