foam/0/turbidity
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      turbidity;
}
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet      { type fixedValue; value uniform 0; }
    outlet     { type zeroGradient; }

    // Sediment reservoir
    seabed     { type fixedValue; value uniform 5; }

    top        { type zeroGradient; }
    side1      { type zeroGradient; }
    side2      { type zeroGradient; }

    submarine  { type zeroGradient; }
}
