foam/constant/physicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}

simulationType  RAS;

viscosityModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1e-06;
