foam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel      Newtonian;

nu nu [0 2 -1 0 0 0 0] 1e-06;

turbidityDiffusivity turbidityDiffusivity [0 2 -1 0 0 0 0]   1e-03;
