foam/system/meshQualityDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshQualityDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Maximum non-orthogonality allowed. Set to 180 to disable.
maxNonOrtho 70;

//- Maximum skewness allowed. Set to <0 to disable.
maxBoundarySkewness 20;
maxInternalSkewness 4;

//- Maximum concaveness allowed. Is angle (in degrees) below which concavity is allowed.
//  0 is straight face, <0 would be convex face. Set to 180 to disable.
maxConcave 80;

//- Minimum cell pyramid volume relative to min bounding box length^3.
//  Set to a fraction of the smallest cell volume expected.
//  Set to a very negative number (e.g. -1e30) to disable.
minVol -1e30;

//- Minimum quality of the tet formed by the face-centre and base points.
//     <0 = inside out tet,
//      0 = flat tet,
//      1 = ideal tet.
minTetQuality 1e-30;

//- Minimum face twist. Set to <-1 to disable. Dot product of face normal and face centre triangle normal.
minTwist 0.05;

//- Minimum normalised cell determinant.
//  1 = ideal hexahedron, <= 0 = folded or flattened illegal cell.
minDeterminant 0.001;

//- Minimum face weight (0 -> 0.5)
minFaceWeight 0.05;

//- Minimum cell volume ratio (0 -> 1)
minVolRatio 0.01;

// Advanced Settings

//- Number of error distribution iterations.
nSmoothScale 4;

//- Amount to scale back displacement at error points.
errorReduction 0.75;

// Optional: relaxed mesh quality controls.
relaxed
{
    //- Maximum non-orthogonality allowed in relaxed phase. Set to 180 to disable.
    maxNonOrtho 75;
}
